backend/artillery-fixed-test.yml
config:
  target: 'ws://localhost:8084'
  phases:
    - duration: 10
      arrivalRate: 2
      name: "수정된 테스트"
  ws:
    connect:
      timeout: 10

scenarios:
  - name: "직관 채팅 테스트"
    weight: 50
    engine: ws
    flow:
      - connect:
          url: "ws://localhost:8084/ws/watch-chat?sessionToken=test-artillery-{{ $randomInt(1, 1000) }}&gameId=1&teamId=1"
      - think: 1
      - send:
          payload: '테스트 메시지'

  - name: "매칭 채팅 테스트"
    weight: 50
    engine: ws
    flow:
      - connect:
          url: "ws://localhost:8084/ws/match-chat?sessionToken=test-artillery-{{ $randomInt(1, 1000) }}&matchId=match_1"
      - think: 1
      - send:
          payload: '매칭 테스트'