backend/artillery-localhost-test.yml
config:
  target: 'ws://localhost:8084'
  phases:
    - duration: 10
      arrivalRate: 2
      name: "로컬 테스트"
  ws:
    connect:
      timeout: 10

scenarios:
  - name: "로컬 직관 채팅 테스트"
    weight: 50
    engine: ws
    flow:
      - connect:
          url: "/ws/watch-chat?sessionToken=test-watch-123&gameId=1&teamId=1"
      - think: 1
      - send: 
          payload: '테스트 메시지'
      - think: 2

  - name: "로컬 매칭 채팅 테스트"  
    weight: 50
    engine: ws
    flow:
      - connect:
          url: "/ws/match-chat?sessionToken=test-match-456&matchId=match_1"
      - think: 1
      - send:
          payload: '매칭 테스트'
      - think: 2