backend/artillery-watch-chat-fixed.yml
config:
  target: 'ws://i13a403.p.ssafy.io:8084'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "직관 채팅 Warm up"
    - duration: 60
      arrivalRate: 10
      name: "직관 채팅 Load Test"
    - duration: 30
      arrivalRate: 20
      name: "직관 채팅 Stress Test"
  ws:
    connect:
      timeout: 15

scenarios:
  - name: "직관 채팅 시나리오 (Redis Pub/Sub)"
    engine: ws
    flow:
      - connect:
          url: "/ws/watch-chat?sessionToken=watch-token-{{ $randomString() }}"
      - think: 1
      - send: 
          payload: '{"type":"CHAT","content":"경기 시작! {{ $randomString() }}"}'
      - think: 2
      - send:
          payload: '{"type":"CHAT","content":"좋은 플레이네요!"}'
      - think: 1
      - send:
          payload: '{"type":"CHAT","content":"화이팅!"}'
      - think: 3
      - send:
          payload: '{"type":"CHAT","content":"GG 잘봤습니다"}'